export type newsType = {
  id?: number;
  time: string;
  label: 'withPhoto' | 'hotNew' | 'online' | 'exclusive' | '';
  text: string;
};

export const mockAllNews: newsType[] = [
  {
    id: 1,
    time: '14:59',
    label: '',
    text: 'Селезньов розповів, навіщо росіяни спустошують склади боєприпасів у Білорусі.',
  },
  {
    id: 2,
    time: '14:59',
    label: 'withPhoto',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 3,
    time: '14:59',
    label: 'hotNew',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
];

export const mockSectionNews: newsType[] = [
  {
    id: 1,
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
    label: '',
  },
  {
    id: 2,
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
    label: 'withPhoto',
  },
  {
    id: 3,
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
    label: '',
  },
  {
    id: 4,
    time: '14:59',
    text: '"Стало відомо, коли ЄС може узгодити сьомий пакет санкцій проти рф',
    label: 'hotNew',
  },
  {
    id: 5,
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
    label: 'online',
  },
  {
    id: 6,
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
    label: 'exclusive',
  },
];
