import { RegionType } from './mockRegions';

export const mockCategoryNews: RegionType[] = [
  {
    id: 1,
    date: '05 серпня',
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
  },
  {
    id: 2,
    date: '05 серпня',
    time: '14:59',
    text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
  },
  {
    id: 3,
    date: '',
    time: '14:59',
    text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
  },
];
