export type RegionType = {
  id: number;
  date: string;
  time: string;
  text: string;
};

export type mockRegionsType = {
  id: number;
  region: string;
  news: RegionType[];
};

export const mockRegions: mockRegionsType[] = [
  {
    id: 1,
    region: 'Київ',
    news: [
      {
        id: 1,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 2,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 3,
        date: '',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
    ],
  },
  {
    id: 2,
    region: 'Одеса',
    news: [
      {
        id: 1,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 2,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 3,
        date: '',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
    ],
  },
  {
    id: 3,
    region: 'Харків',
    news: [
      {
        id: 1,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 2,
        date: '05 серпня',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
      {
        id: 3,
        date: '',
        time: '14:59',
        text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
      },
    ],
  },
];
