import avatar from '../assets/Avatar.png';

export const mockUserColumns = [
  {
    id: 1,
    image: avatar,
    name: 'Юлія Стахівська',
    job: 'Письменниця',
    text: 'Жінок в часи небезпеки приваблюють сильні чоловіки',
    date: '04 серпня 15:15',
  },
  {
    id: 2,
    image: avatar,
    name: 'Юлія Стахівська',
    job: 'Письменниця',
    text: 'Жінок в часи небезпеки приваблюють сильні чоловіки',
    date: '04 серпня 15:15',
  },
  {
    id: 3,
    image: avatar,
    name: 'Юлія Стахівська',
    job: 'Письменниця',
    text: 'Жінок в часи небезпеки приваблюють сильні чоловіки',
    date: '04 серпня 15:15',
  },
];
