import { RegionType } from './mockRegions';

export type newsType = {
  id?: number;
  time: string;
  label: 'withPhoto' | 'hotNew' | 'online' | 'exclusive' | '';
  text: string;
};

export const mockAllNews: newsType[] = [
  {
    id: 1,
    time: '14:59',
    label: '',
    text: 'Селезньов розповів, навіщо росіяни спустошують склади боєприпасів у Білорусі.',
  },
  {
    id: 2,
    time: '14:59',
    label: 'withPhoto',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 3,
    time: '14:59',
    label: 'hotNew',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 4,
    time: '14:59',
    label: 'exclusive',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 5,
    time: '14:59',
    label: '',
    text: 'Селезньов розповів, навіщо росіяни спустошують склади боєприпасів у Білорусі.',
  },
  {
    id: 6,
    time: '14:59',
    label: 'online',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 7,
    time: '14:59',
    label: 'hotNew',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 8,
    time: '14:59',
    label: '',
    text: 'Селезньов розповів, навіщо росіяни спустошують склади боєприпасів у Білорусі.',
  },
  {
    id: 9,
    time: '14:59',
    label: 'withPhoto',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
  {
    id: 10,
    time: '14:59',
    label: 'hotNew',
    text: 'До Європи за захистом. Що означає позов Ахметова до Європейського суду з прав людини',
  },
];

export const mockCategoryNews: RegionType[] = [
  {
    id: 1,
    date: '05 серпня',
    time: '14:59',
    text: '"Відбудова України — завдання усього світу": промова Зеленського на конференції в Лугано',
  },
  {
    id: 2,
    date: '05 серпня',
    time: '14:59',
    text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
  },
  {
    id: 3,
    date: '',
    time: '14:59',
    text: 'Ремонт зруйнованого російськими ракетами будинку у Сергіївці коштуватиме понад 40 млн гривень',
  },
];
