import banner1 from '../../assets/banner.png';

export const mockHeroNews = [
  {
    id: 1,
    text: 'Андрій Єрмак: «В нас інші прізвища, ніж у творців Мінських угод. Людей, які б таке допускали, в нашій команді немає»',
    image: banner1,
  },
  {
    id: 2,
    text: 'Не ми починали цю війну, але це наша трагедія – ми втратили людей, наші міста зруйновані. Тому з нашого боку компромісів точно не буде»',
    image: 'https://i.lb.ua/041/36/63594617df487.jpeg',
  },
  {
    id: 3,
    text: 'Український безпілотний комплекс SHARK запущено у серійне виробництво, – Притула',
    image: 'https://i.lb.ua/060/21/635bfe2f1931d.jpeg',
  },
  {
    id: 4,
    text: 'Не ми починали цю війну, але це наша трагедія – ми втратили людей, наші міста зруйновані. Тому з нашого боку компромісів точно не буде»',
    image: 'https://i.lb.ua/041/36/63594617df487.jpeg',
  },
];
